import styles from '../styles/privacy-policy.module.css';

const PrivacyPolicy = () => {
    return (
        <div className={styles.container}>
            <div  className={styles.paragraph}>
                <div className={styles.header}>Вступ</div>
                <span className={styles.text}>Цей документ пояснює політику конфіденційності нашого веб-сайту та інформує користувачів про те, як ми збираємо, використовуємо та захищаємо їхні особисті дані. Ми прагнемо забезпечити прозорість та довіру, допомагаючи користувачам розуміти свої права та обов'язки під час користування сайтом.</span>
            </div>
            <div  className={styles.paragraph}>
                <div className={styles.header}>Які дані збираються?</div>
                <span className={styles.text}>Через Google Sign-in: Ім'я користувача, Профільна картинка, Електронна пошта: Ці дані використовуються для створення вашого унікального користувацького профілю на нашому сайті. Це дозволяє забезпечити вам безперервний доступ до ваших збережених уподобань, товарів у кошику та інших персоналізованих функцій сайту, незалежно від того, з якого пристрою ви входите.</span>
            </div>
            <div  className={styles.paragraph}>
                <div className={styles.header}>Через використання сайту:</div>
                <span className={styles.text}>Кукі-файли: Ми використовуємо кукі для підтримки роботи кошика, списку бажань, особистого кабінету та збереження обраної мови. Кукі зберігаються у вашому браузері та дозволяють вам відновити свої уподобання під час наступних візитів на сайт. Для незареєстрованих користувачів: Ваші дані (кошик, список бажань, обрана мова) зберігаються тимчасово та доступні лише через браузер, яким ви користуєтеся. Якщо ви зміните пристрій або браузер, ці дані будуть втрачені, поки ви не увійдете через Google Sign In для синхронізації даних.</span>
            </div>
        </div>
    );
};

export default PrivacyPolicy;
